Emile666/stc1000_stm8/src/stc1000p_lib.c
/*==================================================================
  File Name    : stc1000p_lib.c
  Author       : Mats Staffansson / Emile
  ------------------------------------------------------------------
  Purpose : This files contains the relevant functions for the menu,
            thermostat control and other functions needed for th
            STC1000 thermostat hardware WR-032.

            Most of these functions are directly copied from the
            Github library https://github.com/matsstaff/stc1000p.

            The original source is created by Mats Staffansson and
            adapted for the STM8S uC by Emile.
  ------------------------------------------------------------------
  STC1000+ is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
 
  STC1000+ is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
 
  You should have received a copy of the GNU General Public License
  along with STC1000+.  If not, see <http://www.gnu.org/licenses/>.
  ------------------------------------------------------------------
  $Log: $
  ==================================================================
*/ 
#include "stc1000p_lib.h"

// LED character lookup table (0-9)
const uint8_t led_lookup[] = {LED_0,LED_1,LED_2,LED_3,LED_4,LED_5,LED_6,LED_7,LED_8,LED_9};

//----------------------------------------------------------------------------
// These values are stored directly into EEPROM
//----------------------------------------------------------------------------
__root __eeprom const int eedata[] = 
{
#ifdef __IOSTM8S103F3_H__
    // STM8S103F3 with 640 bytes EEPROM
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr0 (SP0, dh0, ..., dh8, SP9)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr1 (SP0, dh0, ..., dh8, SP9)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr2 (SP0, dh0, ..., dh8, SP9)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr3 (SP0, dh0, ..., dh8, SP9)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr4 (SP0, dh0, ..., dh8, SP9)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, 48, 40, 0, 0, 0, 0, 0, 0, // Pr5 (SP0, dh0, ..., dh8, SP9)
#else
    // STM8S003F3 with 128 bytes EEPROM (stock STC1000 IC)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, // Pr0 (SP0, dh0, ..., dh4, SP5)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, // Pr1 (SP0, dh0, ..., dh4, SP5)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, // Pr2 (SP0, dh0, ..., dh4, SP5)
   160, 24, 170, 24, 180, 24, 190, 24, 200, 144, 250, // Pr3 (SP0, dh0, ..., dh4, SP5)
#endif
   MENU_DATA(EEPROM_DEFAULTS) 1 // Last one is for POWER_ON
}; // eedata[]

// Global variables to hold LED data (for multiplexing purposes)
led_e_t led_e = {0x00};         // value of extra LEDs
led_t   led_10, led_1, led_01;  // values of 10s, 1s and 0.1s

uint16_t cooling_delay = 60;    // Initial cooling delay
uint16_t heating_delay = 60;    // Initial heating delay
uint8_t  menustate     = MENU_IDLE; // Current STD state number for menu_fsm()
bool     menu_is_idle  = true;  // No menu active within STD
bool     pwr_on        = true;  // True = power ON, False = power OFF
bool     fahrenheit    = false; // false = Celsius, true = Fahrenheit
bool     minutes       = false; // timing control: false = hours, true = minutes
uint8_t  menu_item     = 0;     // Current menu-item: [0..NO_OF_PROFILES]
uint8_t  config_item   = 0;     // Current index within profile or parameter menu
uint8_t  m_countdown   = 0;     // Timer used within menu_fsm()
uint8_t  _buttons      = 0;     // Current and previous value of button states
int16_t  config_value;          // Current value of menu-item
int8_t   key_held_tmr;          // Timer for value change acceleration
uint8_t  sensor2_selected = 0;  // DOWN button pressed < 3 sec. shows 2nd temperature / pid_output
int16_t  setpoint;              // local copy of SP variable
uint16_t curr_dur = 0;          // local counter for temperature duration
int16_t  pid_out  = 0;          // Output from PID controller in E-1 %
int16_t  hysteresis;            // th-mode: hysteresis for temp probe ; pid-mode: lower hyst. limit in E-1 %
int16_t  hysteresis2;           // th-mode: hysteresis for 2nd temp probe ; pid-mode: upper hyst. limit in E-1 %

// External variables, defined in other files
extern bool     probe2;    // cached flag indicating whether 2nd probe is active
extern int16_t  temp_ntc1; // The temperature in E-1 °C from NTC probe 1
extern int16_t  temp_ntc2; // The temperature in E-1 °C from NTC probe 2
extern uint16_t kc;        // Parameter value for Kc value in %/°C
extern uint16_t ti;        // Parameter value for I action in seconds
extern uint16_t td;        // Parameter value for D action in seconds
extern uint8_t  ts;        // Parameter value for sample time [sec.]

// This contains the definition of the menu-items for the parameters menu
const struct s_menu menu[] = 
{
    MENU_DATA(TO_STRUCT)
}; // menu[]
#define MENU_SIZE (sizeof(menu)/sizeof(menu[0]))

/*-----------------------------------------------------------------------------
  Purpose  : This routine does a divide by 10 using only shifts
  Variables: n: the number to divide by 10
  Returns  : the result
  ---------------------------------------------------------------------------*/
uint16_t divu10(uint16_t n) 
{
  uint16_t q, r;

  q = (n >> 1) + (n >> 2);       // 1/2 + 1/4 = 3/4
  q = q + (q >> 4);              // 3/4 + 3/64 = 51/64
  q = q + (q >> 8);              // 51/64 + 51/(16384) = 13107/16384
  q = q >> 3;                    // 13107 / 131072
  r = n - ((q << 3) + (q << 1)); // 1 - (13107/16384 + 13107/65536) = 1/65536
  return q + ((r + 6) >> 4);     // 13107/131072 + 1/1048576 = 104857 / 1048576  
} // divu10()

/*-----------------------------------------------------------------------------
  Purpose  : This routine is called by menu_fsm() to show the name of the
             menu-item. This can be either one of the Profiles (Pr0, Pr1, ...),
             the text 'SET' (when in the parameter menu) of the text 'th' when
             in thermostat mode.
  Variables: run_mode: [0..NR_OF_PROFILES]
             is_menu : 0=thermostat mode, 1=within a menu         
  Returns  : -
  ---------------------------------------------------------------------------*/
void prx_to_led(uint8_t run_mode, uint8_t is_menu)
{
    led_e.e.negative = 0;
    led_e.e.deg      = 0;
    led_e.e.c        = 0;
    led_e.e.point    = 0;
    if(run_mode < NO_OF_PROFILES)
    {   // one of the profiles
	led_10.raw = LED_P;
	led_1.raw  = LED_r;
	led_01.raw = led_lookup[run_mode];
    } else { // parameter menu
	if (is_menu)
        {   // within menu
	    led_10.raw = LED_S;
	    led_1.raw  = LED_E;
	    led_01.raw = LED_t;
	} else if (ts == 0) 
        { // Thermostat Mode
	    led_10.raw = LED_t; 
	    led_1.raw  = LED_h;
	    led_01.raw = LED_OFF;
	} // else if
        else 
        {   // PID controller mode
	    led_10.raw = LED_P; 
	    led_1.raw  = LED_I;
	    led_01.raw = LED_d;
        } // else
    } // else
} // prx_to_led()

/*-----------------------------------------------------------------------------
  Purpose  : This routine is called by menu_fsm() to show the value of a
             temperature or a non-temperature value.
             In case of a temperature, a decimal point is displayed (for 0.1).
             In case of a non-temperature value, only the value itself is shown.
  Variables: value  : the value to display
             decimal: 0=display as integer, 1=display temperature as xx.1
  Returns  : -
  ---------------------------------------------------------------------------*/
void value_to_led(int value, uint8_t decimal) 
{
	uint8_t i;

	led_e.e.negative = 0;
        if (value < 0) 
        {  // Handle negative values
	   led_e.e.negative = 1;
	   value            = -value;
	} // if

	led_e.e.deg = 0; // ° symbol
        led_e.e.c   = 0; // Celsius symbol
	if(decimal == 1)
        {  // this is a temperature
	   led_e.e.deg = 1;
           if (!fahrenheit) led_e.e.c = 1; // Celsius symbol
	} // if

	// If temperature >= 100 we must loose a decimal...
	if (value >= 1000) 
        {
	   value   = divu10((uint16_t) value);
	   decimal = 0;
	} // if

	// Convert value to BCD and set LED outputs
	if(value >= 100)
        {
	   for(i = 0; value >= 100; i++)
           {
	      value -= 100;
	   } // for
	   led_10.raw = led_lookup[i & 0x0f];
	} else {
	   led_10.raw = LED_OFF; // Turn off led if zero (loose leading zeros)
	} // else
	if (value >= 10 || decimal || led_10.raw != LED_OFF)
        {  // If decimal, we want 1 leading zero
	   for(i = 0; value >= 10; i++)
           {
	      value -= 10;
	   } // for
	   led_1.raw = led_lookup[i];
	   if (decimal)
           {
	      led_1.decimal = 1;
	   } // if
	} else {
	   led_1.raw = LED_OFF; // Turn off led if zero (loose leading zeros)
	} // else
	led_01.raw = led_lookup[(uint8_t)value];
} // value_to_led()

/*-----------------------------------------------------------------------------
  Purpose  : This task updates the current running profile. A profile consists
             of several temperature-time pairs. When a time-out occurs, the
             next temperature-time pair within that profile is selected.
             Updates are stored in the EEPROM configuration.
             It is called once every hour on the hour or every minute.
  Variables: minutes: timing control: false = hours, true = minutes
  Returns  : -
  ---------------------------------------------------------------------------*/
void update_profile(void)
{
  uint8_t  profile_no = eeprom_read_config(EEADR_MENU_ITEM(rn));
  uint8_t  curr_step;            // Current step number within a profile
  uint8_t  profile_step_eeaddr;  // Address index in eeprom for step nr in profile
  uint16_t profile_step_dur;     // Duration of current step
  int16_t  profile_next_step_sp; // Setpoint value of next step in profile
  int16_t  profile_step_sp;      // Setpoint value of current step in profile
  uint16_t t;
  int32_t  sp;
  uint8_t  i;

  // Running profile?
  if (profile_no < THERMOSTAT_MODE) 
  {
      curr_step = eeprom_read_config(EEADR_MENU_ITEM(St));
      if (minutes) // is timing-control in minutes?
           curr_dur++;
      else curr_dur = eeprom_read_config(EEADR_MENU_ITEM(dh)) + 1;

      // Sanity check
      if(curr_step > NO_OF_TT_PAIRS-1) curr_step = NO_OF_TT_PAIRS - 1;

