Emile666/stc1000_stm8/src/stc1000p_lib.c
      profile_step_eeaddr  = EEADR_PROFILE_SETPOINT(profile_no, curr_step);
      profile_step_dur     = eeprom_read_config(profile_step_eeaddr + 1);
      profile_next_step_sp = eeprom_read_config(profile_step_eeaddr + 2);

      // Reached end of step?
      if (curr_dur >= profile_step_dur) 
      {   // Update setpoint with value from next step
	  if (minutes) setpoint = profile_next_step_sp;
	  eeprom_write_config(EEADR_MENU_ITEM(SP), profile_next_step_sp);
	  // Is this the last step (next step is number 9 or next step duration is 0)?
	  if ((curr_step == NO_OF_TT_PAIRS-1) || eeprom_read_config(profile_step_eeaddr + 3) == 0) 
          {   // Switch to thermostat mode.
              eeprom_write_config(EEADR_MENU_ITEM(rn), THERMOSTAT_MODE);
              return; // Fastest way out...
	  } // if
          curr_dur = 0; // Reset duration
	  curr_step++;  // Update step
	  eeprom_write_config(EEADR_MENU_ITEM(St), curr_step);
      } // if
      else if (eeprom_read_config(EEADR_MENU_ITEM(rP))) 
      {  // Is ramping enabled?
         profile_step_sp = eeprom_read_config(profile_step_eeaddr);
	 t  = curr_dur << 6;
	 sp = 32;
	 for (i = 0; i < 64; i++) 
         {   // Linear interpolation of new setpoint (64 substeps)
	     if (t >= profile_step_dur) 
             {
	        t  -= profile_step_dur;
		sp += profile_next_step_sp;
	     } // if
             else 
             {
		sp += profile_step_sp;
	     } // else
	 } // for
	 sp >>= 6;
	 // Update setpoint
	 if (minutes) // is timing-control in minutes?
              setpoint = sp;
         else eeprom_write_config(EEADR_MENU_ITEM(SP), sp);
      } // else if
      if (!minutes)
      {   // Update duration
          eeprom_write_config(EEADR_MENU_ITEM(dh), curr_dur);
      } // if
   } // if
} // update_profile()

/*-----------------------------------------------------------------------------
  Purpose  : This routine checks if a value is within a minimum and maximul value.
             If the value is larger than the maximum, the minimum value is 
             returned (roll-over). If the value is smaller than the minimum, 
             the maximum value is returned (roll-over).
  Variables: x  : the value to check
             min: the minimum allowed value         
             max: the maximum allowed value         
  Returns  : the value itself, or the roll-over value in case of a max./min.
  ---------------------------------------------------------------------------*/
int16_t range(int16_t x, int16_t min, int16_t max)
{
    if (x > max) return min;
    if (x < min) return max;
    return x;
} // range()

/*-----------------------------------------------------------------------------
  Purpose  : This routine checks a parameter value and constrains it to a 
             maximum/minimum value.
  Variables: config_value : the value to check for
             eeadr        : the number of a 16-bit variable within the EEPROM.         
  Returns  : the value itself, or the roll-over value in case of a max./min.
  ---------------------------------------------------------------------------*/
int16_t check_config_value(int16_t config_value, uint8_t eeadr)
{
    int16_t t_min = 0, t_max = 999;
    uint8_t type;
    
    if (eeadr < EEADR_MENU)
    {   // One of the Profiles
	while (eeadr >= PROFILE_SIZE)
        {   // Find the eeprom address within a profile
            eeadr -= PROFILE_SIZE;
	} // while
	if (!(eeadr & 0x1))
        {   // Only constrain a temperature
	    t_min = (fahrenheit ? TEMP_MIN_F : TEMP_MIN_C);
	    t_max = (fahrenheit ? TEMP_MAX_F : TEMP_MAX_C);
	} // if
    } else { // Parameter menu
        type = menu[eeadr - EEADR_MENU].type;
	if (type == t_temperature)
        {
	    t_min = (fahrenheit ? TEMP_MIN_F : TEMP_MIN_C);
	    t_max = (fahrenheit ? TEMP_MAX_F : TEMP_MAX_C);
	} else if (type == t_tempdiff)
        {   // the temperature correction variables
	    t_min = (fahrenheit ? TEMP_CORR_MIN_F : TEMP_CORR_MIN_C);
	    t_max = (fahrenheit ? TEMP_CORR_MAX_F : TEMP_CORR_MAX_C);
	} else if (type == t_parameter)
	    {
		t_max = 9999;
	} else if (type == t_boolean)
        {   // the control variables
	    t_max = 1;
	} else if (type == t_hyst_1)
        {
	    t_max = (fahrenheit ? TEMP_HYST_1_MAX_F : TEMP_HYST_1_MAX_C);
	} else if (type == t_hyst_2)
        {
	    t_max = (fahrenheit ? TEMP_HYST_2_MAX_F : TEMP_HYST_2_MAX_C);
	} else if (type == t_sp_alarm)
        {
	    t_min = (fahrenheit ? SP_ALARM_MIN_F : SP_ALARM_MIN_C);
	    t_max = (fahrenheit ? SP_ALARM_MAX_F : SP_ALARM_MAX_C);
	} else if(type == t_step)
        {
	    t_max = NO_OF_TT_PAIRS;
	} else if (type == t_delay)
        {
	    t_max = 60;
	} else if (type == t_runmode)
        {
	    t_max = NO_OF_PROFILES;
	} // else if
    } // else
    return range(config_value, t_min, t_max);
} // check_config_value()

/*-----------------------------------------------------------------------------
  Purpose  : This routine reads the values of the buttons and returns the
             result. Routine should be called every 100 msec.
             The result is returned in the global variable _buttons. 
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void read_buttons(void)
{
    uint8_t b;
    
    // Save registers that interferes with LED's and disable common-cathodes
    __disable_interrupt();     // Disable interrups while reading buttons
    save_display_state();      // Save current state of 7-segment displays 

    PC_DDR &= ~BUTTONS;        // Set PC6..PC3 as inputs
    PC_CR1 |=  BUTTONS;        // Enable pull-ups for PC6..PC3 (Rpu is approx 45k)
    for (b = 0; b < 10; b++) ; // give port a bit of time
    _buttons <<= 4;            // make room for new values of buttons
    b          = ((PC_IDR & BUTTONS) >> 3); // 3..0: UP, DOWN, PWR, S
    b          = (b ^ 0x0F) & 0x0F;         // Invert buttons (0 = pressed)
    _buttons  |= b;            // add buttons
    PC_DDR    |= BUTTONS;      // Set PC6..PC3 to outputs again
    PC_CR1    |= BUTTONS;      // Set PC6..PC3 to Push-Pull again
        
    restore_display_state();   // Restore state of 7-segment displays
    __enable_interrupt();      // Re-enable Interrupts
} // read_buttons()

/*-----------------------------------------------------------------------------
  Purpose  : This routine is the Finite State Machine (FSM) that controls the
             menu for the 7-segment displays and should be called every 100 msec.
             It used a couple of global variables.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void menu_fsm(void)
{
   uint8_t run_mode, adr, type, eeadr_sp;
   
   if (m_countdown) m_countdown--; // countdown counter
    
