Emile666/stc1000_stm8/src/stc1000p_lib.c
   switch (menustate)
   {
       //--------------------------------------------------------------------         
       case MENU_IDLE:
	    if(BTN_PRESSED(BTN_PWR))
            {
                m_countdown = TMR_POWERDOWN;
                menustate   = MENU_POWER_DOWN_WAIT;
	    } else if(_buttons && eeprom_read_config(EEADR_POWER_ON))
            {
                if (BTN_PRESSED(BTN_UP | BTN_DOWN)) 
                {   // UP and DOWN button pressed
                    menustate = MENU_SHOW_VERSION;
                } else if(BTN_PRESSED(BTN_UP))
                {   // UP button pressed
                    menustate = MENU_SHOW_STATE_UP;
                } else if(BTN_PRESSED(BTN_DOWN))
                {   // DOWN button pressed
                    m_countdown = TMR_SHOW_PROFILE_ITEM;
                    menustate   = MENU_SHOW_STATE_DOWN;
                } else if(BTN_RELEASED(BTN_S))
                {   // S button pressed
                    menustate = MENU_SHOW_MENU_ITEM;
                } // else if
	    } // else
	    break;
       //--------------------------------------------------------------------         
       case MENU_POWER_DOWN_WAIT:
            if (m_countdown == 0)
            {
                pwr_on = eeprom_read_config(EEADR_POWER_ON);
                pwr_on = !pwr_on;
                eeprom_write_config(EEADR_POWER_ON, pwr_on);
                if (pwr_on)
                {
                    heating_delay = 60; // 60 sec.
                    cooling_delay = 60; // 60 sec.
                } // else
                menustate = MENU_IDLE;
            } else if(!BTN_HELD(BTN_PWR))
            {   // 0 = temp_ntc1, 1 = temp_ntc2, 2 = pid-output
                if (++sensor2_selected > 1 + (ts > 0)) sensor2_selected = 0;
                menustate = MENU_IDLE;
            } // else if
            break; // MENU_POWER_DOWN_WAIT
       //--------------------------------------------------------------------         
       case MENU_SHOW_VERSION: // Show STC1000p version number
            value_to_led(STC1000P_VERSION,LEDS_INT);
	    led_10.decimal = 1;
	    led_1.decimal  = 1;
	    led_e.e.deg    = 0;
	    led_e.e.c      = 0;
	    if(!BTN_HELD(BTN_UP | BTN_DOWN)) menustate = MENU_IDLE;
	    break;
       //--------------------------------------------------------------------         
       case MENU_SHOW_STATE_UP: // Show setpoint value
	    if (minutes) // is timing-control in minutes?
                 value_to_led(setpoint,LEDS_TEMP);
	    else value_to_led(eeprom_read_config(EEADR_MENU_ITEM(SP)),LEDS_TEMP);
	    if(!BTN_HELD(BTN_UP)) menustate = MENU_IDLE;
	    break;
       //--------------------------------------------------------------------         
       case MENU_SHOW_STATE_DOWN: // Show Profile-number
	    run_mode = eeprom_read_config(EEADR_MENU_ITEM(rn));
            prx_to_led(run_mode,LEDS_RUN_MODE);
            if ((run_mode < THERMOSTAT_MODE) && (m_countdown == 0))
            {
                m_countdown = TMR_SHOW_PROFILE_ITEM;
                menustate   = MENU_SHOW_STATE_DOWN_2;
            } // if
	    if(!BTN_HELD(BTN_DOWN)) menustate = MENU_IDLE;
	    break;
       //--------------------------------------------------------------------         
       case MENU_SHOW_STATE_DOWN_2: // Show current step number within profile
	    value_to_led(eeprom_read_config(EEADR_MENU_ITEM(St)),LEDS_INT);
	    if(m_countdown == 0)
            {
                m_countdown = TMR_SHOW_PROFILE_ITEM;
                menustate   = MENU_SHOW_STATE_DOWN_3;
	    }
	    if(!BTN_HELD(BTN_DOWN)) menustate = MENU_IDLE;
	    break;
       //--------------------------------------------------------------------         
       case MENU_SHOW_STATE_DOWN_3: // Show current duration of running profile
            if (minutes) // is timing-control in minutes?
                 value_to_led(curr_dur,LEDS_INT);
            else value_to_led(eeprom_read_config(EEADR_MENU_ITEM(dh)),LEDS_INT);
            if(m_countdown == 0)
            {   // Time-Out
                m_countdown = TMR_SHOW_PROFILE_ITEM;
                menustate   = MENU_SHOW_STATE_DOWN;
            } // if
            if(!BTN_HELD(BTN_DOWN))
            {   // Down button is released again
                menustate = MENU_IDLE;
            } // if
            break; // MENU_SHOW_STATE_DOWN_3
       //--------------------------------------------------------------------         
       case MENU_SHOW_MENU_ITEM: // S-button was pressed
            prx_to_led(menu_item, LEDS_MENU);
            m_countdown = TMR_NO_KEY_TIMEOUT;
            menustate   = MENU_SET_MENU_ITEM;
            break; // MENU_SHOW_MENU_ITEM
       //--------------------------------------------------------------------         
       case MENU_SET_MENU_ITEM:
            if(m_countdown == 0 || BTN_RELEASED(BTN_PWR))
            {   // On Time-out of S-button released, go back
                menustate = MENU_IDLE;
            } else if(BTN_RELEASED(BTN_UP))
            {
                if(++menu_item > MENU_ITEM_NO) menu_item = 0;
                menustate = MENU_SHOW_MENU_ITEM;
            } else if(BTN_RELEASED(BTN_DOWN))
            {
                if(--menu_item > MENU_ITEM_NO) menu_item = MENU_ITEM_NO;
                menustate = MENU_SHOW_MENU_ITEM;
            } else if(BTN_RELEASED(BTN_S))
            {   // only go to next state if S-button is released
                config_item = 0;
                menustate   = MENU_SHOW_CONFIG_ITEM;
            } // else if
            break; // MENU_SET_MENU_ITEM
       //--------------------------------------------------------------------         
       case MENU_SHOW_CONFIG_ITEM: // S-button is released
	    led_e.e.negative = 0;
	    led_e.e.deg      = 0;
	    led_e.e.c        = 0;
	    if(menu_item < MENU_ITEM_NO)
            {
                if(config_item & 0x1) 
                {   
                    led_10.raw = LED_d; // duration: 2nd value of a profile-step
                    led_1.raw  = LED_h;
                } else {
                    led_10.raw = LED_S; // setpoint: 1st value of a profile-step
                    led_1.raw  = LED_P;
                } // else
                led_01.raw = led_lookup[(config_item >> 1)];
	    } else /* if (menu_item == 6) */
            {   // show parameter name
                led_10.raw = menu[config_item].led_c_10;
                led_1.raw  = menu[config_item].led_c_1;
                led_01.raw = menu[config_item].led_c_01;
	    } // else
	    m_countdown = TMR_NO_KEY_TIMEOUT;
	    menustate   = MENU_SET_CONFIG_ITEM;
	    break;
       //--------------------------------------------------------------------         
       case MENU_SET_CONFIG_ITEM:
	    if(m_countdown == 0)
            {   // Timeout, go back to idle state
                menustate = MENU_IDLE;
	    } else if(BTN_RELEASED(BTN_PWR))
            {   // Go back
                menustate = MENU_SHOW_MENU_ITEM;
            } else if(BTN_RELEASED(BTN_UP))
            {
                config_item++;
                if(menu_item < MENU_ITEM_NO)
                {
                    if(config_item >= PROFILE_SIZE)
                    {
                        config_item = 0;
                    } // if
                } else {
                    if(config_item >= MENU_SIZE)
                    {
                        config_item = 0;
                    }
                    /* Jump to exit code shared with BTN_DOWN case */
                    /* GOTO's are frowned upon, but avoiding code duplication saves precious code space */
                    goto chk_skip_menu_item;
                } // else
                menustate = MENU_SHOW_CONFIG_ITEM;
            } else if(BTN_RELEASED(BTN_DOWN))
            {
                config_item--;
                if(menu_item < MENU_ITEM_NO)
                {   // One of the profiles
                    if(config_item >= PROFILE_SIZE)
                    {
                        config_item = PROFILE_SIZE-1;
                    } // if
                } else { // Menu with parameters
                    if(config_item > MENU_SIZE-1)
                    {
                        config_item = MENU_SIZE-1;
                    } // if
            chk_skip_menu_item: // label for goto
                    if (!minutes && ((uint8_t)eeprom_read_config(EEADR_MENU_ITEM(rn)) >= THERMOSTAT_MODE))
                    {
                        if (config_item == St)
                        {   // Skip current profile-step and duration
                            config_item += 2;
                        }else if (config_item == dh)
                        {   // Skip current profile-step and duration
                            config_item -= 2;
                        } // else if
                    } // if
                } // else
                menustate = MENU_SHOW_CONFIG_ITEM;
            } else if(BTN_RELEASED(BTN_S))
            {   // S-button is released again
                adr          = MI_CI_TO_EEADR(menu_item, config_item);
                config_value = eeprom_read_config(adr);
                config_value = check_config_value(config_value, adr);
                m_countdown  = TMR_NO_KEY_TIMEOUT;
                menustate    = MENU_SHOW_CONFIG_VALUE;
            } // else if
       break; // MENU_SET_CONFIG_ITEM
       //--------------------------------------------------------------------         
       case MENU_SHOW_CONFIG_VALUE:
            if(menu_item < MENU_ITEM_NO)
            {   // Display duration as integer, temperature in 0.1
                value_to_led(config_value, (config_item & 0x1) ? LEDS_INT : LEDS_TEMP);
            } else 
            {   /* menu_item == MENU_ITEM_NO */ 
                type = menu[config_item].type;
                if(MENU_TYPE_IS_TEMPERATURE(type))
                {   // temperature, display in 0.1
                    value_to_led(config_value,LEDS_TEMP);
                } else if (type == t_runmode)
                {
                    prx_to_led(config_value,LEDS_RUN_MODE);
                } else { // others, display as integer
                    value_to_led(config_value,LEDS_INT);
                } // else
            } // else
            m_countdown  = TMR_NO_KEY_TIMEOUT;
            menustate    = MENU_SET_CONFIG_VALUE;
            break;
       //--------------------------------------------------------------------         
       case MENU_SET_CONFIG_VALUE:
            adr = MI_CI_TO_EEADR(menu_item, config_item);
            if (m_countdown == 0)
            {
                menustate = MENU_IDLE;
            } else if (BTN_RELEASED(BTN_PWR))
            {
                menustate = MENU_SHOW_CONFIG_ITEM;
            } else if(BTN_HELD_OR_RELEASED(BTN_UP)) 
            {
                config_value++;
                if ((config_value > 1000) || (--key_held_tmr < 0))
                {
                    config_value += 9;
                } // if
                /* Jump to exit code shared with BTN_DOWN case */
                goto chk_cfg_acc_label;
            } else if(BTN_HELD_OR_RELEASED(BTN_DOWN)) 
            {
                config_value--;
                if ((config_value > 1000) || (--key_held_tmr < 0))
                {
                    config_value -= 9;
                } // if
            chk_cfg_acc_label: // label for goto
                config_value = check_config_value(config_value, adr);
                menustate    = MENU_SHOW_CONFIG_VALUE;
            } else if(BTN_RELEASED(BTN_S))
            {
                if(menu_item == MENU_ITEM_NO)
                {   // We are in the parameter menu
                    if(config_item == rn)
                    {   // When setting run-mode, clear current step & duration
                        eeprom_write_config(EEADR_MENU_ITEM(St), 0);
                        if (minutes)
                             curr_dur = 0;
                        else eeprom_write_config(EEADR_MENU_ITEM(dh), 0);
                        if(config_value < THERMOSTAT_MODE)
                        {
                            eeadr_sp = EEADR_PROFILE_SETPOINT(((uint8_t)config_value), 0);
                            // Set initial value for SP
                            if (minutes)
                            {
                                setpoint = eeprom_read_config(eeadr_sp);
                                eeprom_write_config(EEADR_MENU_ITEM(SP), setpoint);
                            } else {
                                eeprom_write_config(EEADR_MENU_ITEM(SP), eeprom_read_config(eeadr_sp));
                            } // else if
                            // Hack in case inital step duration is '0'
                            if(eeprom_read_config(eeadr_sp+1) == 0)
                            {   // Set to thermostat mode
                                config_value = THERMOSTAT_MODE;
                            } // if
                        } // if
                    } // if
                } // if
                eeprom_write_config(adr, config_value);
                menustate = MENU_SHOW_CONFIG_ITEM;
            } else 
            {   // reset timer to default value
                key_held_tmr = TMR_KEY_ACC; 
            } // else
            break; // MENU_SET_CONFIG_VALUE
       //--------------------------------------------------------------------         
       default:
            menustate = MENU_IDLE;
            break;
   } /* switch(menustate) */
   menu_is_idle = (menustate == MENU_IDLE); // needed for ctrl_task()
} // button_menu_fsm()

/*-----------------------------------------------------------------------------
  Purpose  : This routine initialises the heating and cooling delays.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void init_temp_delays(void)
{
    if (!minutes) setpoint = eeprom_read_config(EEADR_MENU_ITEM(SP));
    hysteresis  = eeprom_read_config(EEADR_MENU_ITEM(hy));
    hysteresis2 = eeprom_read_config(EEADR_MENU_ITEM(hy2));

    if(cooling_delay) cooling_delay--;
    if(heating_delay) heating_delay--;

    // Set LED outputs
    led_e.e.cool = COOL_STATUS; // Cooling
    led_e.e.heat = HEAT_STATUS; // Heating
} // init_temp_delays()

/*-----------------------------------------------------------------------------
  Purpose  : This routine converts a menu item in minutes to a value in seconds.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
uint16_t min_to_sec(enum menu_enum x)
{
    uint16_t retv;
   
    retv = eeprom_read_config(EEADR_MENU_ITEM(x)) << 6; // * 64
    retv = retv - (retv >> 4); // 64 - 4 = 60
    return retv;
} // min_to_sec()

/*-----------------------------------------------------------------------------
  Purpose  : This routine controls the temperature setpoints. It should be 
             called once every second by ctrl_task().
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void temperature_control(void)
{
    init_temp_delays(); // Initialise Heating and Cooling delay

