Emile666/stc1000_stm8/src/stc1000p_lib.c
    // This is the thermostat logic
    if (!pwr_on ||
       (COOL_STATUS && (temp_ntc1 <= setpoint || (probe2 && (temp_ntc2 < (setpoint - hysteresis2))))) || 
       (HEAT_STATUS && (temp_ntc1 >= setpoint || (probe2 && (temp_ntc2 > (setpoint + hysteresis2))))))
    {
        cooling_delay = min_to_sec(cd);
        heating_delay = min_to_sec(hd);
	RELAYS_OFF; // Disable Cooling and Heating relays
    } // if
    else if(!HEAT_STATUS && !COOL_STATUS) 
    {
	hysteresis2 >>= 2; // Divide hysteresis2 by 2
	if ((temp_ntc1 > setpoint + hysteresis) && (!probe2 || (temp_ntc2 >= setpoint - hysteresis2))) 
        {
	    if (cooling_delay) // Flash to indicate cooling delay
	         led_e.e.cool = led_e.e.cool ^ (cooling_delay & 0x1); 
	    else COOL_ON; // Enable Cooling
	} else if ((temp_ntc1 < setpoint - hysteresis) && (probe2 || (temp_ntc2 <= setpoint + hysteresis2))) 
        {
	    if (heating_delay) // Flash to indicate heating delay 
	         led_e.e.heat = led_e.e.heat ^ (heating_delay & 0x1); 
	    else HEAT_ON; // Enable Heating
	} // else if
    } // else if
} // temperature_control()

/*-----------------------------------------------------------------------------
  Purpose  : This routine controls the PID controller. It should be 
             called once every second by ctrl_task() as long as TS is not 0. 
             The PID controller itself is called every TS seconds.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void pid_control(void)
{
    static uint8_t pid_tmr = 0;
    
    init_temp_delays(); // Initialise Heating and Cooling delay

    if (kc != eeprom_read_config(EEADR_MENU_ITEM(Hc)) ||
        ti != eeprom_read_config(EEADR_MENU_ITEM(Ti)) ||
        td != eeprom_read_config(EEADR_MENU_ITEM(Td)))
    {   // One or more PID parameters have changed
       kc = eeprom_read_config(EEADR_MENU_ITEM(Hc));
       ti = eeprom_read_config(EEADR_MENU_ITEM(Ti));
       td = eeprom_read_config(EEADR_MENU_ITEM(Td));
       init_pid(kc,ti,td,ts,temp_ntc1); // Init PID controller
    } // if
    
    if (++pid_tmr >= ts) 
    {   // Call PID controller every TS seconds
        pid_ctrl(temp_ntc1,&pid_out,setpoint);
        pid_tmr = 0;
    } // if
    // --------- Logic for HEATING -----------------------------------
    if (!pwr_on || (HEAT_STATUS && (pid_out <= hysteresis)))
    {   // heating and pid-output drops below hysteresis limit in E-1 %
        heating_delay = min_to_sec(hd);
	HEAT_OFF; // Disable Heating
    } // if    
    else if (!HEAT_STATUS && (pid_out >= hysteresis2))
    {   // pwr_on && !heating && pid output exceeds hysteresis limit in E-1 %
        if (heating_delay) // Flash to indicate heating delay
	     led_e.e.heat = led_e.e.heat ^ (heating_delay & 0x1); 
	else HEAT_ON; // Enable Heating
    } // else if
    // --------- Logic for COOLING -----------------------------------
    if (!pwr_on || (COOL_STATUS && (pid_out >= -hysteresis)))
    {   // cooling and pid-output exceeds upper hysteresis limit in E-1 %
        cooling_delay = min_to_sec(cd);
	COOL_OFF; // Disable cooling
    } // if    
    else if (!COOL_STATUS && (pid_out <= -hysteresis2))
    {   // pwr_on && !cooling && pid-output drops below hysteresis limit in E-1 %
        if (cooling_delay) // Flash to indicate cooling delay
	     led_e.e.cool = led_e.e.cool ^ (cooling_delay & 0x1); 
	else COOL_ON; // Enable Cooling
    } // else if
} // pid_control()
